sograindustries/nrf52_fw/projects/proto_fw_argos/src/main.c
static uint32_t   ecg_control            = 0;
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

bool filter_enable = true;
#define ADSBUFFER ads_buf
#define ADSBUFFERDEPTH 1024
CIRC_GBUF_DEF(int32_t, ADSBUFFER, ADSBUFFERDEPTH)

const nrf_drv_timer_t TIMER_LED = NRF_DRV_TIMER_INSTANCE(1);

void get_mock_normal_adc(int32_t* data, int length) {
  static int offset = 0;
  for (int ii = 0; ii < length; ii++) {
    data[ii] = mock_normal_data[offset];
    offset++;
    offset %= NORMAL_ADC_SAMPLES;
  }
}

bool get_ads_data(int32_t* data, int length){
  int data_count;
  // Checks if we have enough data in the queue.
  data_count = ADSBUFFERDEPTH - CIRC_GBUF_FS(ADSBUFFER);
  if(data_count < length && data_count > 0)
    return false;

  for(int ii = 0; ii < length; ii++) {
    CIRC_GBUF_POP(ADSBUFFER, &data[ii]);
  }
  return true;
}

void get_mock_abnormal_adc(int32_t* data, int length) {
  static int offset = 0;
  for (int ii = 0; ii < length; ii++) {
    data[ii] = mock_abnormal_data[offset];
    offset++;
    offset %= ABNORMAL_ADC_SAMPLES;
  }
}

void get_ramp(int32_t* data, int length) {
  static int16_t value = 0;
  for(int ii = 0; ii < length; ii++) {
    data[ii] = value++;
  }
}

void get_constant(int32_t* data, int length, int16_t constant) {
  for(int ii = 0; ii < length; ii++) {
    data[ii] = constant;
  }
}

void update_led(uint8_t mask) {
  for (int ii = 0; ii < 4; ii++) {
    if ((mask >> ii) & 0x1) {
      bsp_board_led_on(ii);
    } else {
      bsp_board_led_off(ii);
    }
  }
}

/**
 * @brief Handler for timer events.
 */
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
  
    // 1 uint32 packet count, 1 byte status, 30 int32 samples
    const int kNumSamples = 30;
    const uint16_t data_length = sizeof(uint32_t) + sizeof(int32_t)*kNumSamples + 1;
    static uint8_t index = 10;
    uint32_t           err_code;
    static uint32_t timer_count = 0;
    uint32_t status = 0;
    int timer_count_size = sizeof(timer_count);
    bool update;
    int call_count = 0;


    static uint32_t packet_count =0;
    uint32_t * data_array_ptr;

    ble_arrhythmia_s ble_arrhythmia;
    int16_t ble_arrhythmia_size = sizeof(ble_arrhythmia);
    update = true;

    data_array_ptr = (int32_t*) (data_array + sizeof(uint32_t) + 1);
    *((uint32_t*)data_array) = packet_count;

    // Populates status bit
    data_array[4] = filter_enable ? 0 : 1;
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE1:
            timer_count++;
            ble_ecg_uptime_set(&m_nus, m_conn_handle, timer_count);

            status = 255 - ((timer_count >> 5) % 256);
            ble_ecg_status_set(&m_nus, m_conn_handle, status);
            if (ecg_control & 0x1) {
              switch ((ecg_control >> 1) & 0x3) {
                case 0:
                  if (call_count == 0) {
                    get_ramp(data_array_ptr, kNumSamples);
                    update = true;
                  } else {
                    update = false;
                  }
                  break;
                case 1:
                  update = get_ads_data(data_array_ptr, kNumSamples);
                  break;
                case 2:
                  if (call_count == 0) {
                    get_mock_normal_adc(data_array_ptr, kNumSamples);
                    update = true;
                  } else {
                    update = false;
                  }
                  break;
                case 3:
                  if (call_count == 0) {
                    get_constant(data_array_ptr, kNumSamples, 1);
                    update = true;
                  } else {
                    update = false;
                  }
                  break;
                default:
                  break;
              }
              if (update){
                ble_nus_data_send(&m_nus, data_array, &data_length, m_conn_handle);
                ++packet_count;
              }
            }

            if (((timer_count % 50) == 0) && ((ecg_control >> 7) & 0x1)) {
              NRF_LOG_DEBUG("Arrhythmia!");
              ble_arrhythmia.timestamp = timer_count;
              ble_arrhythmia.arrythmia = 3;
              NRF_LOG_DEBUG("Size: %d", sizeof(ble_arrhythmia));
              ble_ecg_arrhythmia_send(&m_nus, &ble_arrhythmia, &ble_arrhythmia_size, m_conn_handle);
            }
            // TODO(andy) Double check this number.
            call_count++;
            call_count %= 15;
            break;
        default:
            //Do nothing.
            break;
    }

}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

