sograindustries/nrf52_fw/projects/proto_fw_argos/src/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    bool status;
    int32_t adc_value;
    int32_t filter_out;
    int32_t ecg_data;
    uint32_t time_ms = 20; //Time(in miliseconds) between consecutive compare events.
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;
    int data_count;
    int32_t data_buf[30];
    //uint8_t data_buf[80];
    uint16_t data_length = 120;
    LPFilter filter;
    ads_pins_t ads_pins;
    nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(0);  /**< SPI instance. */

    // HP IIR Filter Definition
    float hp_num[3] = {0.99835013, -1.99670027,  0.99835013};
    float hp_den[2] = {-1.99692777,  0.99693255};
    int num_d[2] = {0, 0};
    int den_d[2] = {0, 0};
    int hp_out;
    
    // Initialize.
    sd_power_gpregret_clr(0, 0xff); 
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

   //Configure TIMER_LED for generating simple light effect - leds on board will invert his state one after the other.
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_31250Hz;
    err_code = nrf_drv_timer_init(&TIMER_LED, &timer_cfg, timer_event_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_LED, time_ms);
    NRF_LOG_INFO("Timer Configured!");

    nrf_drv_timer_extended_compare(
         &TIMER_LED, NRF_TIMER_CC_CHANNEL1, time_ticks, NRF_TIMER_SHORT_COMPARE1_CLEAR_MASK, true);

    nrf_drv_timer_enable(&TIMER_LED);

    // Start execution.
    NRF_LOG_INFO("Argos Proto Dev FW");
    NRF_LOG_FLUSH();

    LPFilter_init(&filter);

    // Sets up the ADS chip config
    ads_pins.miso = ADS_MISO_PIN;
    ads_pins.mosi = ADS_MOSI_PIN;
    ads_pins.sck = ADS_SCK_PIN;
    ads_pins.csn = ADS_CSN_PIN;
    ads_pins.rst = ADS_RST_PIN;
    ads_pins.drdy = ADS_DRDY_PIN;
    ads_pins.start = ADS_START_PIN;
    ads_pins.clksel = ADS_CLKSEL_PIN;

    status = AdsInit(spi, ads_pins);
    if( !status) {
      NRF_LOG_WARNING("Failed to init ADS!");
      NRF_LOG_FLUSH();
      while(1);
    }
  
    NRF_LOG_INFO("DEVICEID0: %08X", NRF_FICR->DEVICEID[0]);
    NRF_LOG_INFO("DEVICEID1: %08X", NRF_FICR->DEVICEID[1]);

    advertising_start();
    //while (nrf_gpio_pin_read(ADS_DRDY_PIN) == 0)
    //  ;
    nrf_drv_gpiote_in_event_enable(ADS_DRDY_PIN, true);
    // Enter main loop.
    data_count = 0;
    time_ticks = 0;
    for (;;) {
      NRF_LOG_FLUSH();
      while(1){
        __WFE();
        if (AdsNewData()) {
          break;
        }
      };

      /*
      for( data_count = 0; data_count < 30; data_count++) {
        data_buf[data_count] = AdsGetData();
      }
      ble_nus_data_send(&m_nus, (uint8_t*)data_buf, &data_length, m_conn_handle);
  */
      /*
      while (new_data == false);
      new_data = false;
*/
      adc_value = AdsGetData();

      // Passes through the HP filter
      hp_out = hp_num[0] * adc_value + 
               hp_num[1] * num_d[0] + 
               hp_num[2] * num_d[1] -
               hp_den[0] * den_d[0] -
               hp_den[1] * den_d[1];
      num_d[1] = num_d[0];
      num_d[0] = adc_value;
      den_d[1] = den_d[0];
      den_d[0] = hp_out;

      LPFilter_put(&filter, hp_out);
      ecg_data = LPFilter_get(&filter);

      if (ecg_control & 0x200) {
        filter_enable = false;
      } else {
        filter_enable = true;
      }
      
      if (ecg_control & 0x1) {
        if (filter_enable) {
          if(CIRC_GBUF_PUSH(ADSBUFFER,&ecg_data)){
           NRF_LOG_ERROR("ADS Buffer Overflow!");
           NRF_LOG_FLUSH();
        }
        } else {
          if(CIRC_GBUF_PUSH(ADSBUFFER,&adc_value)){
            NRF_LOG_ERROR("ADS Buffer Overflow!");
           NRF_LOG_FLUSH();
        }
        }
      } 
        
//    ads_overflow = true;
      /*
      data_buf[data_count] = ecg_data ;
      //data_buf[2*data_count+1] = (ecg_data & 0xff00) >> 8;
      data_count++;
      if(data_count == 30) {
        ble_nus_data_send(&m_nus, (uint8_t*)data_buf, &data_length, m_conn_handle);
        data_count = 0;
        //NRF_LOG_INFO("%d", ecg_data);
 //       NRF_LOG_INFO("%d", time_ticks++);
 //       NRF_LOG_FLUSH();
      }
      //NRF_LOG_FLUSH();
*/
      
    }
}
//ble_nus_data_send(&m_nus, data_array, &data_length, m_conn_handle);
/**
 * @}
 */
